= Bluetooth Low Energy技術の概要

通信技術は、利用場面と結びつくことで価値が生じます。Bluetooth Low Energy技術は、機械と機械とがおしゃべりをするような通信技術です。

この章では、Bluetooth Low Energy技術の特徴とその仕組みとを、大まかに見ていきます。まず、この技術が使われている1つの利用場面を通じて、この技術が利用場面をどのように支えているかを見ていきます。次に、この技術の活用場面を考える材料として、電波の性質や通信と組み合わせる技術要素を知りましょう。

== Bluetooth Low Energy技術の利用場面とその仕組み

Bluetooth Low Energy技術は、2010年に公開されたBluetooth4.0で、初めてBluetooth無線技術に統合された新技術です。2010年からも、この技術は、新たな活用や利用場面に向けて、更新され続けています。ですが、その基本はBluetooth4.0から変わりません。

フィットネスでよく使われる心拍センサーを1例にして、基本的なBluetooth Low Energy技術の特徴が、利用場面をどのように支えているのかを見ていきます。

=== 心拍センサーとその活用場面

スポーツ用品店などに行くと、パッケージに、スマートホンとつないで使えると書かれた、Bluetooth無線技術の青色のロゴマークがついた心拍センサーが、数千円であります。脂肪の燃焼や心肺能力の向上などの、トレーニング目的に適した心拍値を保つために、心拍センサーが使われます。

心拍センサーは、様々な企業から、原理の異なるいくつかの製品が出ています。ここでは、胸ベルトタイプの心拍センサーを購入したとします。心臓の筋肉が発する微小な電位差を、胸に巻いたベルトの電極と配線を通じて検出するものです。

まず本体に、指先に乗るような大きさのコイン型電池を入れます。電源スイッチは、ありません。ベルトを胸に巻くと、皮膚を通じて微小な電流が流れるので、それを検出して自動的に電源が入ります。

次に、スマートホンに、アプリケーションをインストールします。これは、心拍センサーを販売している企業が出しているものや、あるいはフィットネスやトレーニング向けの他社のアプリケーションなどから、使いたいものを選びます。

アプリケーションを立ち上げて、心拍センサーの接続画面を開きます。装着している心拍センサーが、接続可能な心拍センサーのリストに表示されているはずです。その項目を選択して、しばらく待つと、センサーが検出している心拍数が、アプリケーションの画面に表示されます。

使用後は、ベルトを外すと、心拍センサーは自動的に電源がオフになります。アプリケーションの、センサーとの接続画面では、センサーとの接続が切れていると表示されます。次回の使用では、ベルトをつければ心拍センサーの電源が入り、アプリケーションは自動的に心拍センサーと接続します。

=== 活用場面を支える制度と技術

Bluetooth Low Energy技術を使う心拍センサーは、電波を送信しますが、購入して誰でもすぐに使用できます。これは、いわゆる技適と呼ばれる仕組みのおかげです。誰もが勝手に電波を送信すると混信するので、基本的には免許状の交付を受けて初めて、電波が送信できます。ですが、この技術が使う周波数帯、2.4ギガヘルツ帯では、技術基準を満たす証明を取得した機器であれば、誰でもその機器を使えます。

Bluetooth Low Energy技術は、様々なものに使えるように、無線通信回路としては、安価に製造できるように工夫されています。アンテナや半導体を1つにまとめた無線通信機能を部品として扱える無線通信モジュールが、各社から5米ドルほどで販売されています。この部品を使った製品は、数千円で販売されます。

超低消費電力無線通信技術のおかげで、心拍センサーは容量の小さなコイン型電池1つで、半年から1年は動作します。超がつかない低消費電力無線通信技術でも、心拍センサーは作れます。ですが、毎月のように電池を交換をしたり、容量の大きな電池を採用すれば、身につけるものなのに、大きく重くなります。

心拍センサーだけを購入して、自分のスマートホンとつなげて使えるのは、Bluetooth無線技術の認証があるからです。どの企業がいつ製造したかに関わらず、この技術を示す青色のロゴマークがついていれば、相互に接続して利用ができます。もしもこの技術をつかわないならば、何か独自の無線技術を採用して、心拍センサーと、それと無線接続する心拍数の液晶表示器とを、セットにして販売するほかないでしょう。

スマートホンにアプリケーションをインストールして、心拍センサーが利用できるのは、アプリケーションからGATT基盤と呼ばれる仕組みが使えるからです。GATT基盤は、無線通信でデジタル・データをやり取りするBluetooth Low Energy技術の基本技術です。

このGATT基盤を利用して機器や利用場面が作られます。その仕様を、プロファイルと呼びます。アプリケーションは、心拍センサーのプロファイルの仕様に従い、GATT基盤を通じて心拍センサーから心拍数を読み出します。多種多様なものへの対応は、アプリケーションが担います。

スマートホンのアプリケーションは、通信相手の発見と通信の開始と終了ができます。心拍センサーが身につければ、アプリケーションがそれを検出して自動的に連携するような、自然で手間のない体験が提供できます。

=== スマートホンとの連携

新たに登場した無線技術が、素早く普及することは、まずありません。通信には、通信相手が必要です。Bluetooth無線技術のブランド力と、スマートホンの存在とが、Bluetooth Low Energy技術を驚くほど急速に普及させました。

Bluetooth Low Energy技術の登場以前に、パソコンで使われていたワイヤレスマウスは、マウスと無線通信するUSBドングルが付属していました。無線通信技術は、見えない電線として、1つの製品の中で閉じて使われていました。

Bluetooth4.0で、Bluetooth無線技術は、Bluetooth Low Energy技術を統合しました。つまり、Bluetooth4.0以降では、Bluetooth無線技術を採用すれば、そこには必ずBluetooth Low Energy技術があります。

2010年に、初めてBluetooth4.0を採用した製品、iPhone4Sが登場しました。通信相手になる製品の登場で、周辺機器も登場し始めます。Bluetooth Low Energy技術は、それ以前のワイヤレスマウスのような製品の中で閉じた無線通信技術ではなく、多種多様な製品をつなぐ開かれた基盤になりました。

iPhoneとAndroidは、スマートホンの二大プラットホームです。Bluetooth Low Energy技術の登場した当初から、スマートホンのアプリケーションに、GATT基盤のAPIが開放されました。それ以前は、インタフェースやライセンスの問題で不可能だった、二大プラットホームのいずれでも使える周辺機器が、Bluetooth Low Energy技術を使えば可能になったのです。

Bluetooth Low Energy技術と、スマートホンを中核にした活用場面の相性のよさも、この技術の活用が広がった理由でしょう。Bluetooth Low Energy技術は、電波が届く範囲にあるなにかと、電波で直接やりとりをする技術です。他の通信技術のように、いわゆるインターネット・プロトコルの利用を前提にしたものでは、ありません。

前節の心拍計を思い出します。もしもスマートホンというものが存在していなければ、心拍計は単体で心拍データをどこかに送信しなければなりません。近距離のデジタル無線通信技術あるいは移動体通信網を用いて、インターネット・プロトコルで、現場にあるデータ収集のためのパソコンか、あるいは世界のどこかにあるサーバーにデータを届けるでしょう。

ですが、心拍計を利用している人は、ほぼスマートホンを持っています。スマートホンと心拍計の間にある、ほんの数メートルの距離でデータをやりとりし続ける技術として、Bluetooth Low Energy技術は最適です。この技術のピコ・ネットは、利用の中心に一人の利用者がいる場面に最適です。その通信にインターネット・プロトコルは必要ではありません。また、世界のどこかにあるサーバーにデータを届けたければ、その役割はスマートホンのアプリケーションに任せればよいのです。

=== プロファイルとその柔軟さ

Bluetooth無線技術では、機器の振る舞いとGATT基盤のデータ定義の仕様を、GATTベースのプロファイルと呼びます。このGATTベースのプロファイルの柔軟さが、Bluetooth Low Energy技術の、多種多様な活用を生み出します。プロファイルの活用は、承認したプロファイル、カスタム・プロファイルを用いたアプセサリ、そしてプラットホームのカスタム・プロファイルの3つに分類できます。

まず、Bluetooth SIGが承認したプロファイルがあります。例えば、キーボードは、製造企業に関わらずBluetoothのロゴマークがついていれば、すぐに使えなければ困ります。もしも、製造企業ごとに独自のカスタム・プロファイルを用いれば、その製造企業のデバイス・ドライバや対応アプリケーションを入れなければ、使えないものになってしまいます。

周辺機器は、Bluetooth Low Energy技術が活躍する大きな市場です。例えば、キーボードには、HID over GATT Profile (HOGP)という、Bluetooth SIGが承認したプロファイルが使われます。Bluetooth認証プロセスに、承認されたプロファイルを満たしているかのテストも含まれています。この承認されたプロファイルと認証制度のおかげで、製造企業に関わらず、キーボードはキーボードとしてすぐに使えます。

Bluetooth Low Energy技術は、カスタム・プロファイルつまり独自のプロファイルで機器が作れます。GATT基盤のAPIがありますから、カスタム・プロファイルに対応したアプリケーションは、アプリ・ストアから配布できます。アプリケーションと機器との連携で、それ以前にはなかった体験を新たに生み出せます。それは、アプリケーションとアクセサリの2つの単語を組み合わせた、アプセサリという造語で呼ばれます。

スマートホンのプラットホームも、カスタム・プロファイルを活用しています。Apple Pencileは、iPadと接続して、その魅力を高めています。このほかにも、マイクロ・ロケーションと近接検出のiBeaconの電波ビーコンや、スマート家電の基盤となるHomeKitなど、多種多様な活用に、カスタム・プロファイルが使われています。

プラットホームのカスタム・プロファイルは、他社にライセンス供給されるものもありますが、その供給方法はプラットホームごとに異なります。Apple社であれば、Made for iPhone(MFi)プログラムで、開発および製造のライセンスが供与されます。MFiプログラムへは、秘密保持契約を締結して参加します。プログラムに参加していないものが、その技術情報を知ることはできません。

これまでになかった周辺機器が、新たに登場した場合は、どのようにすればよいでしょうか。1社あるいはプラットホームで閉じて提供するならば、カスタム・プロファイルで提供すればよいでしょう。複数の企業で市場を形成したいならば、プロファイルをBluetooth SIGに承認してもらうことができます。この場合は、承認を欲するものが、Bluetooth SIGにメンバーとして参加して、そこで議論を重ねて技術的に適切で客観的なプロファイルであると認めてもらいます。

=== 通信技術の特徴とその活用

1990年代に製造されたパソコンの背面を見ると、キーボードを接続するPS/2コネクタ、あるいはモニタやプリンタなどの、周辺機器の種類ごとにコネクタがあります。現代では、もはやUSBコネクタのみのパソコンもあります。周辺機器とのやりとりがソフトウェア処理になれば、物理的にデータをやり取りするインタフェースは、用途を満たすいくつかの技術に集約します。

スマートホンには、モバイル網、Wi-Fi、そしてBluetooth Low Energy技術を含むBluetooth無線技術の3つがあります。モバイル網とWi-Fiは、インターネット・プロトコルの利用を前提にしています。デジタル・データをより短時間で途切れずに届ける方向に、進歩を重ねています。

Bluetooth Low Energy技術ではないBluetooth無線技術は、近距離無線通信技術として、電池の制約がある分野で、音楽を途切れずに、遅延時間を感じさせない通話を支えています。いわば目には見えない透明な電線のように、常にデータが流れ続ける利用場面を支えてきました。

そしてBluetooth Low Energy技術は、より電池や製造コストの制約が厳しい分野で、やり取りしたい少量のデジタル・データを、適切な遅延時間で伝える場面を支えています。ぽつぽつと話しをするような、ぼんやりとした雰囲気のような通信と言えます。

Bluetooth Low Energy技術は、新たな利用場面に向けて、柔軟に進歩し続けています。電波の伝わる性質を積極的に活用したビーコンとしての活用例が登場すると、そこに向けて電波のやってくる方向を見つける技術を盛り込みました。また、本来は向いていないオーディオ分野に、コネクション・レスな音声伝送や、左右で独立したワイヤレス・イヤホンに適した、新たな技術を導入しました。

== Bluetooth Low Energy技術の仕組み

ここまでのBluetooth Low Energy技術を見て、あまりにも自由に活用ができるため、具体的に何をすればいいのかと思うかもしれません。この技術の活用は、ジグソーパズルを作るようなものかもしれません。電波の性質やアプリケーション、あるいはハードウェアといった、1つ1つの技術要素というピースを組み合わせて、利用体験という1つの絵が完成します。ピースが欠けていれば、絵になりません。また、絵それ自体ががいまいちであれば、完成したものもいまいちでしょう。

Bluetooth Low Energ技術は、とてもシンプルな技術ですが、いくつかの異なる技術分野の組み合わせです。









=== microbitで遊んでみる
原理は知らないけど、とりあえず。

=== 遊んでみた中で、技術の基本のところ
ピコネット。
GATT概要。
通信の流れ。

=== 通信は常にペア2つ

無線通信、
データのやり取り、
サービスとキャラクタリスティクス。

流れと技術の大雑把なところ。
構成、スマホ+デバイス、に限定してみましょう。

まず無線通信、直接電波のやり取り。
役割は2つ、セントラル、ペリフェラル。

その内部構成、物理層、通信、アプリ部分、コードの構成。
物理層が高価なのと、たくさん入れられないので、ソフトウェア的に集約。
規格的には、TBD台、でも物理的に無理。iPhoneでは、同時接続はTBD台。

=== 場面とその通信、相手の発見
=== GATT基盤
== イントロ
BLEってどんなもの、どう使う。基本。
ストーリ、その特徴と、その仕組み。
電波の特性、活用方法、
環境に支えられている、何が使えるのか、通信部分だけじゃない。部品、利用場面、環境、基盤。
=== すっごい基本の仕組みと通信
今、なんかデータを送信して、受信する何かがあるとしましょう。これを使ってBLEごっこ。
==== 基本のストーリー
通信は、発見、接続、読み書き。ちょっと流れを見てみる。よくわかんないと思うので、スマホのアプリからデバイスにアクセスするストーリー。

作るものは2つ。構成は、アプリと、スマホ。画面のボタンを押したら、データが飛んで、デバイスに届いて、LEDがつきますよ。これがどう動くんだろう。

通信の処理と、ボタンからLEDをつけるデータの書き込み、デバイス側はLEDをつけたり。デバイスのスイッチを押したら、アプリに届く。

==== 相手を見つける、見つけてもらう

デバイス側が、アドバタイジング。スキャン。発見する。タイミングを合わせて、電波の送信と受信タイミングを合わせる。

ビーコン的な使い方。

このタイミングが秒単位で長くできる、超低消費電力って、単純に、電波のやり取り時間が瞬間。RF回路を動かすこと自体が結構大変なので。

==== サービス、キャラクタリスティクス

詳しいことは、次の節で。

普通だと、何か特別なデータ構成。アプリとアプリ、ネットワークプログラミングでよくみるやつ。
もちょっと工夫が入ってる。それがこの仕組み。ちょっとややこしいんだろうけど。
バッテリーのサービスは、他のプロファイルで再利用できる。データの構造と振る舞いとをそれぞれ自由に再利用できる。変化があれば、ノーティフィケーション、インディケーション。登録しておけば、デバイスから伝えてくれる。ボタンを押したら。受け取るべきデータをポーリンすぐするのは無駄だから。

役割、ペリフェラル、セントラル。
多種多様さ、幾つもの接続、機械としての抽象化、再利用的なもの、要め。

どんなサービスやキャラクタリスティクスがあるのかを読み出す。キャッシュする。
目的のキャラクタリスティクスに書き込む。値の変更通知を受け取る。

==== ペアリングとボンディング
ここでは出してないけど。電波はどこでも聞けるし、悪意を持っていたら、受信し続けて追跡、プライバシー的な情報の読み出し、電波を出して外からイタズラ。めっちゃ低価格でも、現代的な最新の強度。

セキュリティ、暗号化、認証、結構色々。ベースは、鍵の交換。高度な暗号化。
何も交換しない、
ペアリグして、
ボンディングして、

ちょっとめんどくさいのが、鍵の管理はOSなので、設定画面に行っちゃうの。アプリから勝手に全てできる、と言ったけど、そこは手が出ないので。

==== まとめ
作るなら、
プロファイル、どういう振る舞いで、読み書き、データの意味とかを決める。
スマホのアプリ、デバイスのファームウェア、そのパケットのやり取り。
-> スマホのアプリってどうやって作るの? デバイスの電気回路とか、ファームウェアってどうやって作るの?

BT4.0の基本的な使い方。大体はこれだけど、ここから10年、時代や新たな用途に合わせて、新聞屋を切り開くために、できることを増やしている。またその話は次で。

=== Bluetooth無線通信技術とBLE

オリジナルの通信。1社で、ハードウェアから全てを用意して、その会社の製品同士で通信できる。方式をそろえて、いろんな会社が参加する。BT SIG、非営利団体で。近接無線通信。

規格は常に進歩する。

BTから分離したBLE。

==== 規格の発展

個別のアプリケーションを作る部分と、それを支える基盤。コア仕様書 + プロファイル。

コア仕様書は:
Bluetooth 1.0, 2.0, 3.0, 4.0, 5.0 ...
メジャー番号、電波をやり取りする方式が、より高度なものが入る感じ、高速化、長距離化。
BLEが入ったのは、4.0から。後方互換性が一部切れた、特別なブランド名があったけど、今はない。

バッサリ言えば、目に見えない周辺機器の電線。機器で設定すれば、切れない、つながり続ける。あまり多様な使い方はない。BLEは、雰囲気みたいなぼやっとした会話可能空間の確保的なもの、いつでも声をかければ会話できる、みたいな。よく切れるし、素早く再接続してれば実用的に問題はない。設計思想が違うので、切れることに拘らない感じ。

クラシックBTは、今後も存在する。ここで話するのは、BT4.0の、BLEの部分だけ。

BLEは、カスタム・プロファイルが基本。(後で詳しく)

==== 普及と発展

プラットホームというか、利用場面ありき。スマホの存在が大きい。アプリから自由に使える方法。iPhoneとAndroid。特にiPhoneでは、MFiという特別なプログラム。製造まで管理されるので、ちょっと大変。スマホとリアル世界の1メートルを埋める強力さ。

ソフト的な構成。ドライバに相当する部分が、アプリに入る。発見、接続、読み書き。でも、キーボードとかは、OSが。日本語変換とかめちゃくちゃ複雑。世界各国のキーボードに全て対応。アプリで。やってられない。一般的なデバイスは。

開発の環境、デバイス側、めちゃくちゃオープンになってきた。

代理店経由、質問も。各国の代理店でリアルな開発対応。1つ開発すれば、大口顧客を確実にサポートする。質問も確実だけど、とにかく時間がかかる。それ以前とは全く違う。それを知る必要ももうないけど。

デバイス側の構成。Nordic社。開発リソースをネット公開、開発者のフォーラム、誰でも登録可能。いわゆるオープンソース。

==== プロファイルの多様さと進歩

サービスとキャラクタリスティクス。コネクションレスを支える。

読み書きの単位だけじゃなくて、データの構造と。
勝手に定義して、勝手に振る舞いを作れる。カスタム・プロファイル。SIGの承認とれば。

データの長さって、結構制限されるので。大体は、それで用が足りる。
単なるデータのストリームやりたいなら、L2CAPチャンネルを。

プロファイル:
基本、カスタム・プロファイル。
承認なプロファイル。SIGに参加して、客観的なプロファイルを作り、登録する。技術の取りまとめ、市場を作るのに役立つ。デバイス側だと、競合と一緒になって作っていく方が利益が大きい。例えばキーボードとか。
カスタム+勝手な機能を入れることも可能。ガチガチではない。後で説明する。

コア仕様と共に:
5.0 長距離化、高速化
5.2 音声、特別なデータの伝え方

==== 今まで出てきた流れ
スマホのアプリから、なんでも使えるように。クラウドファンディング、フィットネス、万歩計的なのと健康やフィットネスのサービス。当初から計画されていた、ANT+の分野。

ビーコン的な使い方。

AirTag。ユーザの端末が、全てモニタしている状態のやつ。

==== まとめ

- 従来BTとBLEは、全く別物です。
- 多種多様と市場の形成を両立する仕組みです。
- 今時の自由な開発環境がある、後での認証は気をつけてね。
- めっちゃ技術の進歩があるので、バージョンでできること違うので。新しいことは学んでね。
- 機器開発するなら、SIGに参加して市場を作っていくのもいいかもね。

=== 電波と無線通信

BTは、理想的な時でも大体100メートルくらい届く、近距離無線通信。

==== 電磁波と電波

BLEは電波を使う。
電波の性質: 
物質に影響される。ものに吸収される。金属とかだと反射する。周波数で、この辺りの振る舞いが違う。
周波数のある範囲のものだと、電気回路で作ったり、検出して受信できる。

磁石や静電気の体験。それが波となって広がっていく。髪の毛が逆立てば、肌でわかるけど、リアルな電磁波は人には感じ取れない。めちゃくちゃ早く変化する波で、力もさほどは大きくないので。電波の工学、めちゃくちゃ高感度に送信されてきたものだけを選別して検出する、受信の技術。熱になるので、肌があったかくなるとかでわかるけど。光も電磁波。X線、諸々。

電波は、そのうち周波数をXXXの範囲を、電波。電気回路で扱える、法律として、扱える資源。電波という資源、勝手に使うと混信。

==== 電波という資源の使い方

電波という資源:
勝手に使うと混信するので、管理なり運営なりが必要。
国際的な取り組みと、国ごとの。
各国の電波法がある。基本は、免許制度。でも、機器側に認証を寄せるやり方で、ものとして販売して利用。
使われ方。周波数で伝わり方が違うのと、歴史的に低い周波数から実用化されていったので、積み上げ。
長波、広域な放送、短波、電離層反射で国際的な放送、超短波、使える周波数の幅があるのでテレビ、デジタル。桁が上がるごとに、使える情報量が劇的に上がっていく。

世界的な仕組みで、周波数をどう使うか、その区分で、国家ごとに。国を跨いで伝わる短波、地球をぐるぐる回る衛星通信。もっと周波数の高い電波は、電離層を突き抜ける。国ごとで閉じるもの。ラジオやテレビ、アマチュア無線。基本は、電波を出す装置を届けて、審査して、免許証を与える。国家試験で、免許人を、資格で。

#@# 新たに出てきた単語:
#@# 電磁波
#@# 周波数
#@# 電波

==== BLEは電波を使う2.4Ghz帯

2.4GHzという周波数帯を使う。電子レンジみたいなことにはならない。600Wとかあるけど、5桁小さいので、1mWくらいで。感じ取れない。10万台ほどびっちり周囲を囲ったら、行けるかも?遠赤外線を出すパネルヒーターみたいに。

歴史的に各国で、使われないままに空いている領域を。国ごとに周波数割り当てがバラバラだと大変。データ通信に。周波数の幅があるので、高速なデジタル無線通信にいける。いろんな方式でごちゃっと使う感じ。

統一しているので、同じ製品を各国で使える。免許がいらない方法。装置が基準を満たしている、製造側でチェック。買えば使える。免許を取らないとダメなやり方だと、めんどくさすぎる。

電波を出す方式、物理層。物理層を便利に使う何かのブランド、Wi-Fiのうち、xxxの方式。LoRA(2.4GHz版)、物理層(Zigbee,)、Bluetooth無線通信技術。

#@# 新たに出てきた単語:
#@# 物理層

==== 認証

国ごとの認証: 電波の出力や質が規定を満たしているのか(いろんな方式があるので、等しく電波を使えるのか技術的な)
SIGによる認証。の2つがあります。趣味で使う場合は、後者はいらないのでしょうけど。前者は常に満たす必要がある。

電波を出す部分                      商売する?       
認証があるモジュール                   する         
独自の回路設計(認証がないモジュール)     しない
製品                                (グレー)

絶対に必ず必要: 国ごとの認証
商売するなら必要: SIG (仕入れて販売する時は、自社ブランドか、小売か)

#@# 疑問: 組織内部で、閉じて使う。グレーゾーン?

==== 伝わり方や制限
電波の知識、伝わり方。基本は、諦める。

距離が離れれば。
吸収、反射、干渉。ものがあれば吸収、反射でちょうど消しあったり強めあったり。

他の方式との共存。周波数幅あたりの出力。出力目一杯まで出すのは、あんまりやらない。電力消費が増えるのと、認証を取るのがめんどくさくなるのと。
極端な指向性も。少なくとも送信は。BLEは、どこに相手がいるのかわからない使い方するので、そもそも指向性は出せないけど。

周りに物を置かない、見通しの位置に設置する。例えば、ビーコンだと、数メートルごとに、天井に設置、床にいるスマホから見ると、必ず見通し距離、直線。

==== まとめ

- 電波は資源で法律があります。気が付かずに違反でアウトなので、知っておきましょう。
- 電波の性質は、その振る舞いを理解するのに役立ちます。あんまり回避する方法にはなりませんけど。
- 電波の基本的な性質、真空を伝わる波。基本的な波の性質。
- 通信は環境に影響される。物質で吸収や反射。
- 通信の周りの影響。例えば、日曜のファミレスで。たくさんのパケット、衝突、通信。

=== ちょっと使ってみよう
ここまでの知識で、考えて、組み合わせる。

とりあえず、スマホを中心にしてみよう。(デバイス+アプリ)
基本的には、ベースはおんなじ。使いやすいように、整えてあるだけ。

手早く始める、プロトタイピング。教材的な。
もちょっとプロとタイピング。作例が色々あるやつ。
ちょっと本格的に開発してみよう。デバイスの環境とか。ソフト開発環境、低レベル。組み込み。

==== アイディアの出し方
教材や、サンプルを見ていく。
センサーから発想する。
こんなサービス、から逆算で。
すでにあるものを見てみる。分解しているものを見てみる。サービスを、要素に分解してみる。
性質から考える。特性として、スマホを身につけるわけにはいかない。センサーだけ。

例えば、体に使うもの: 物理量、センサー、事業(関心、利益)

==== デバイス側、ちょっと始めてみる
Maker:的な。教育向けのキット。マイコンを使ったもの、ラズパイなど。

==== アプリ側、ちょっと始めてみる
アプリケーションの構造、自分が使う、いろんな人が使ってもらう。
IDE(ネイティブ、Flutter的な)、プロトタイピング環境的な。
簡単なアプリを作れる、アプリ。簡易な開発環境。
チェックするのは、サンプルがあるのか、言語を覚えたりスキルがあるのか。

==== チームでの進め方

==== まとめ

